<!doctype html>
<html>
<head>
<meta charset="utf-8">
<title>Namyod</title>
<style type="text/css">
body {
    background-color: #FBFFDC;
}
</style>
</head>

<body>
<h1 align="center">โปรแกรมคำนวณระบบน้ำหยด</h1>
	<p align="center"><img src="pic3.gif" width="900" height="416" alt=""/></p>
<p align="center"><strong>ชนิดของพืชที่ต้องการใช้น้ำน้อยเหมาะสมกับการปลูกในฤดูแล้ง :</strong></p>
<p align="center">	<strong>1. คะน้า 2. กวางตุ้ง 3. ถั่วฝักยาว 4. มะระจีน 5. แตงกวา</strong></p>
<p align="center"><strong>6. พริก 7. ข้าวโพดหวาน 8. มันเทศ 9. แตงโม</strong></p>
<p align="center">กรุณากรอกข้อมูลให้ครบ</p>
<form id="form1" name="form1" method="post">
  <p align="center">
    <label for="textfield">ชนิดของพืชที่ต้องการทราบ(ตัวเลข) :</label>
    <input type="text" name="num" id="num">
  </p>
  <p align="center">
    <label for="textfield2">จำนวนพื้นที่ :</label>
    <input type="text" name="a" id="a">
    ไร่
  </p>
  <p align="center">
    <input type="submit" name="submit" id="submit" value="คำนวณ">
  </p>
</form>
<?php
	$number=$_POST['num'];
	$n1=1;
	$n2=2;
	$n3=3;
	$n4=4;
	$n5=5;
	$n6=6;
	$n7=7;
	$n8=8;
	$n9=9;
	$area=$_POST['a'];
	$cost=$area*4000;
	
	if ($number==$n1) {
		echo"คะน้า <br>";
		echo"1. ควรปลูกคะน้าโดยมีระยะห่างระหว่างต้น 20 เซนติเมตร <br>";
		echo"2. คะน้าต้องการน้ำประมาณ 5,090 ลิตร/วัน/ไร่ <br>";
		echo"3. คะน้ามีระยะเวลาถึงการเก็บเกี่ยวประมาณ 55 วัน จึงต้องการน้ำประมาณ 275,000 ลิตร/ตลอดอายุเก็บเกี่ยว/ไร่ <br>";
		echo"4. คุณมีจำนวนพื้นที่ $area ไร่ จะต้องใช้ต้นทุนเกี่ยวกับอุปกรณ์ของระบบน้ำหยดประมาณ $cost บาท <br>";
	}elseif($number==$n2){
		echo"กวางตุ้ง <br>";
		echo"1. ควรปลูกกวางตุ้งโดยมีระยะห่างระหว่างต้น 20-25 เซนติเมตร <br>";
		echo"2. กวางตุ้งต้องการน้ำประมาณ 5,130 ลิตร/วัน/ไร่ <br>";
		echo"3. กวางตุ้งมีระยะเวลาถึงการเก็บเกี่ยวประมาณ 45 วัน จึงต้องการน้ำประมาณ 300,000 ลิตร/วัน/ไร่ <br>";
		echo"4. คุณมีจำนวนพื้นที่ $area ไร่ จะต้องใช้ต้นทุนเกี่ยวกับอุปกรณ์ของระบบน้ำหยดประมาณ $cost บาท <br>";
	}elseif($number==$n3){
		echo"ถั่วฝักยาว <br>";
		echo"1. ควรปลูกถั่วฝักยาวโดยมีระยะห่างระหว่างต้น 40-50 เซนติเมตร <br>";
		echo"2. ถั่วฝักยาวต้องการน้ำประมาณ 6,080 ลิตร/วัน/ไร่ <br>";
		echo"3. ถั่วฝักยาวมีระยะเวลาถึงการเก็บเกี่ยวประมาณ 80 วัน จึงต้องการน้ำประมาณ 477,000 ลิตร/ตลอดอายุเก็บเกี่ยว/ไร่ <br>";
		echo"4. คุณมีจำนวนพื้นที่ $area ไร่ จะต้องใช้ต้นทุนเกี่ยวกับอุปกรณ์ของระบบน้ำหยดประมาณ $cost บาท <br>";
	}elseif($number==$n4){
		echo"มะระจีน <br>";
		echo"1. ควรปลูกมะระจีนโดยมีระยะห่างระหว่างต้น 80 เซนติเมตร <br>";
		echo"2. มะระจีนต้องการน้ำประมาณ 7,360 ลิตร/วัน/ไร่ <br>";
		echo"3. มะระจีนมีระยะเวลาถึงการเก็บเกี่ยวประมาณ 75 วัน จึงต้องการน้ำประมาณ 542,000 ลิตร/ตลอดอายุเก็บเกี่ยว/ไร่ <br>";
		echo"4. คุณมีจำนวนพื้นที่ $area ไร่ จะต้องใช้ต้นทุนเกี่ยวกับอุปกรณ์ของระบบน้ำหยดประมาณ $cost บาท <br>";
	}elseif($number==$n5){
		echo"แตงกวา <br>";
		echo"1. ควรปลูกแตงกวาโดยมีระยะห่างระหว่างต้น 40-50 เซนติเมตร <br>";
		echo"2. แตงกวาต้องการน้ำประมาณ 18,600 ลิตร/วัน/ไร่ <br>";
		echo"3. แตงกวามีระยะเวลาถึงการเก็บเกี่ยวประมาณ 150 วัน จึงต้องการน้ำประมาณ 700,000 ลิตร/ตลอดอายุเก็บเกี่ยว/ไร่ <br>";
		echo"4. คุณมีจำนวนพื้นที่ $area ไร่ จะต้องใช้ต้นทุนเกี่ยวกับอุปกรณ์ของระบบน้ำหยดประมาณ $cost บาท <br>";
	}elseif($number==$n6){
		echo"พริก <br>";
		echo"1. ควรปลูกพริกโดยมีระยะห่างระหว่างต้น 50 เซนติเมตร <br>";
		echo"2. พริกต้องการน้ำประมาณ 5,460 ลิตร/วัน/ไร่ <br>";
		echo"3. พริกมีระยะเวลาถึงการเก็บเกี่ยวประมาณ 30 วัน จึงต้องการน้ำประมาณ 804,000 ลิตร/ตลอดอายุเก็บเกี่ยว/ไร่ <br>";
		echo"4. คุณมีจำนวนพื้นที่ $area ไร่ จะต้องใช้ต้นทุนเกี่ยวกับอุปกรณ์ของระบบน้ำหยดประมาณ $cost บาท <br>";
	}elseif($number==$n7){
		echo"ข้าวโพดหวาน <br>";
		echo"1. ควรปลูกข้าวโพดหวานโดยมีระยะห่างระหว่างต้น 25 เซนติเมตร <br>";
		echo"2. ข้าวโพดหวานต้องการน้ำประมาณ 6,190 ลิตร/วัน/ไร่ <br>";
		echo"3. ข้าวโพดหวานมีระยะเวลาถึงการเก็บเกี่ยวประมาณ 75 วัน จึงต้องการน้ำประมาณ 456,000 ลิตร/ตลอดอายุเก็บเกี่ยว/ไร่ <br>";
		echo"4. คุณมีจำนวนพื้นที่ $area ไร่ จะต้องใช้ต้นทุนเกี่ยวกับอุปกรณ์ของระบบน้ำหยดประมาณ $cost บาท <br>";
	}elseif($number==$n8){
		echo"มันเทศ <br>";
		echo"1. ควรปลูกมันเทศโดยมีระยะห่างระหว่างต้น 50-100 เซนติเมตร <br>";
		echo"2. มันเทศต้องการน้ำประมาณ 6,300 ลิตร/วัน/ไร่ <br>";
		echo"3. มันเทศมีระยะเวลาถึงการเก็บเกี่ยวประมาณ 125 วัน จึงต้องการน้ำประมาณ 773,000 ลิตร/ตลอดอายุเก็บเกี่ยว/ไร่ <br>";
		echo"4. คุณมีจำนวนพื้นที่ $area ไร่ จะต้องใช้ต้นทุนเกี่ยวกับอุปกรณ์ของระบบน้ำหยดประมาณ $cost บาท <br>";
	}elseif($number==$n9){
		echo"แตงโม <br>";
		echo"1. ควรปลูกแตงโมโดยมีระยะห่างระหว่างต้น 80 เซนติเมตร <br>";
		echo"2. แตงโมต้องการน้ำประมาณ 8,380 ลิตร/วัน/ไร่ <br>";
		echo"3. แตงโมมีระยะเวลาถึงการเก็บเกี่ยวประมาณ 85 วัน จึงต้องการน้ำประมาณ 695,000 ลิตร/ตลอดอายุเก็บเกี่ยว/ไร่ <br>";
		echo"4. คุณมีจำนวนพื้นที่ $area ไร่ จะต้องใช้ต้นทุนเกี่ยวกับอุปกรณ์ของระบบน้ำหยดประมาณ $cost บาท <br>";
	}else{
		echo"รายการที่คุณเลือกไม่ได้อยู่ในรายการที่มี<br>";
		echo"กรุณาลองใหม่อีกครั้งค่ะ<br>";
	}
	echo"<br><br>หมายเหตุ : อ้างอิงข้อมูลการใช้น้ำของพืชแต่ละชนิดจากสำนักงานบริหารจัดการน้ำและอุทกวิทยา และกรมส่งเสริมการเกษตร<br>";
	echo"สามารถเข้าดูได้ที่ http://water.rid.go.th/hwm/cropwater/CWRdata/ET/index.htm เรื่อง'ปริมาณการใช้น้ำของพืช'<br>";
	echo"และสามารถเข้าดูอ้างอิงรูปภาพต่างๆ ได้ที่ ";
	echo"<a href='refer.html'>อ้างอิง</a><br>";
?>
<p>&nbsp;</p>
</body>
</html>